{"id":"b10ld001-cafe-4200-dead-000000000001","rule_id":"b10ld001-cafe-4200-dead-000000000001","name":"[Loaded Potato] BYOVD - Known Vulnerable Driver Loaded (Sysmon EID 6)","description":"Detects Sysmon Event ID 6 (DriverLoad) for any driver in the LOL Drivers database. Attackers load signed but exploitable kernel drivers (BYOVD  -  Bring Your Own Vulnerable Driver) to disable EDR/AV, escalate to ring-0 privileges, or read/write kernel memory. MITRE ATT\u0026CK: T1068 (Exploitation for Privilege Escalation), T1543.003 (Windows Service). Sources: loldrivers.io API + LOLDrivers Sigma + SigmaHQ. Cache contains 418 drivers as of 2026-03-31. Enable rule and set schedule appropriate to your environment. Regenerate from menu option 10e after updating the LOL Drivers cache.","enabled":false,"type":"query","language":"kuery","query":"winlog.event_id: 6 AND winlog.event_data.ImageLoaded: (*\\\\0x3040_blacklotus_beta_driver.sys OR *\\\\0x3440_blacklotus_v2_driver.sys OR *\\\\8492937_2_driver.sys OR *\\\\accellid.sys OR *\\\\ace-base.sys OR *\\\\acpix86.sys OR *\\\\adrmdrvsys.sys OR *\\\\adv64drv.sys OR *\\\\agent64.sys OR *\\\\air_system10.sys OR *\\\\alsysio.sys OR *\\\\alsysio64.sys OR *\\\\amdpowerprofiler.sys OR *\\\\amdryzenmasterdriver.sys OR *\\\\amifldrv.sys OR *\\\\amifldrv64.sys OR *\\\\amigendrv64.sys OR *\\\\amp.sys OR *\\\\ampa.sys OR *\\\\amsdk.sys OR *\\\\aoddriver.sys OR *\\\\aoddriver2.sys OR *\\\\asas.sys OR *\\\\asio.sys OR *\\\\asio2.sys OR *\\\\asio3.sys OR *\\\\asio3_64.sys OR *\\\\asio32.sys OR *\\\\asio64.sys OR *\\\\asmio.sys OR *\\\\asmio64.sys OR *\\\\asmmap.sys OR *\\\\asmmap64.sys OR *\\\\asrautochkupddrv.sys OR *\\\\asrautochkupddrv_1_0_32.sys OR *\\\\asrdrv.sys OR *\\\\asrdrv10.sys OR *\\\\asrdrv101.sys OR *\\\\asrdrv102.sys OR *\\\\asrdrv103.sys OR *\\\\asrdrv104.sys OR *\\\\asrdrv106.sys OR *\\\\asribdrv.sys OR *\\\\asromgdrv.sys OR *\\\\asrrapidstartdrv.sys OR *\\\\asrsetupdrv103.sys OR *\\\\asrsmartconnectdrv.sys OR *\\\\asupio.sys OR *\\\\asupio64.sys OR *\\\\aswarpot.sys OR *\\\\aswvmm.sys OR *\\\\atillk64.sys OR *\\\\atlaccess.sys OR *\\\\atomicredteamcapcom.sys OR *\\\\atszio.sys OR *\\\\atszio64.sys OR *\\\\avalueio.sys OR *\\\\bandai.sys OR *\\\\bdapiutil.sys OR *\\\\bdapiutil64.sys OR *\\\\bedaisy.sys OR *\\\\biontdrv.sys OR *\\\\black.sys OR *\\\\blackbone.sys OR *\\\\blackbonedrv10.sys OR *\\\\blacklotus_beta_driver.sys OR *\\\\blacklotus_beta_driver_2.sys OR *\\\\blacklotus_beta_driver_3.sys OR *\\\\blacklotus_beta_driver_4.sys OR *\\\\bs_def.sys OR *\\\\bs_def64.sys OR *\\\\bs_flash64.sys OR *\\\\bs_hwmio64.sys OR *\\\\bs_hwmio64_w10.sys OR *\\\\bs_i2c64.sys OR *\\\\bs_i2cio.sys OR *\\\\bs_rcio.sys OR *\\\\bs_rcio64.sys OR *\\\\bs_rciow1064.sys OR *\\\\bsmemx64.sys OR *\\\\bsmi.sys OR *\\\\bsmix64.sys OR *\\\\bsmixp64.sys OR *\\\\burntcigar.sys OR *\\\\bwrs.sys OR *\\\\bwrsh.sys OR *\\\\capcom.sys OR *\\\\capcom2.sys OR *\\\\cg6kwin2k.sys OR *\\\\changsha.sys OR *\\\\chaos-rootkit.sys OR *\\\\citmdrv_amd64.sys OR *\\\\citmdrv_ia64.sys OR *\\\\computerz.sys OR *\\\\corsairllaccess64.sys OR *\\\\cp2x72c.sys OR *\\\\cpupress.sys OR *\\\\cpuz.sys OR *\\\\cpuz_x64.sys OR *\\\\cpuz141.sys OR *\\\\csagent.sys OR *\\\\ctiio64.sys OR *\\\\cupfixerx64.sys OR *\\\\cyvrlpc.sys OR *\\\\daxin_blank.sys OR *\\\\daxin_blank1.sys OR *\\\\daxin_blank2.sys OR *\\\\daxin_blank3.sys OR *\\\\daxin_blank4.sys OR *\\\\daxin_blank5.sys OR *\\\\daxin_blank6.sys OR *\\\\dbk64.sys OR *\\\\dbutil.sys OR *\\\\dbutil_2_3.sys OR *\\\\dbutildrv2.sys OR *\\\\dcprotect.sys OR *\\\\dcr.sys OR *\\\\dellbios.sys OR *\\\\dellinstrumentation.sys OR *\\\\dh_kernel.sys OR *\\\\dh_kernel_10.sys OR *\\\\directio.sys OR *\\\\directio32.sys OR *\\\\directio32_legacy.sys OR *\\\\directio64.sys OR *\\\\dkrtk.sys OR *\\\\driver7.sys OR *\\\\driver7-x64.sys OR *\\\\driver7-x86.sys OR *\\\\driver7-x86-withoutdbg.sys OR *\\\\dwadsafeload.sys OR *\\\\echo.sys OR *\\\\echo_driver.sys OR *\\\\echodriver.sys OR *\\\\ecsiodriver.sys OR *\\\\ecsiodriverx64.sys OR *\\\\eio.sys OR *\\\\elbycdio.sys OR *\\\\elrawdsk.sys OR *\\\\ene.sys OR *\\\\eneio64.sys OR *\\\\enetechio64.sys OR *\\\\etdsupp.sys OR *\\\\fairplaykd.sys OR *\\\\fd3b7234419fafc9bdd533f48896ed73_b816c5cd.sys OR *\\\\fgme.sys OR *\\\\fh-ethercat_dio.sys OR *\\\\fiddrv.sys OR *\\\\fiddrv64.sys OR *\\\\fidpcidrv.sys OR *\\\\fidpcidrv64.sys OR *\\\\fildds.sys OR *\\\\filnk.sys OR *\\\\filwfp.sys OR *\\\\fpcie2com.sys OR *\\\\full.sys OR *\\\\gameink.sys OR *\\\\gametersafe.sys OR *\\\\gdrv.sys OR *\\\\gedevdrv.sys OR *\\\\gftkyj64.sys OR *\\\\glckio2.sys OR *\\\\gmer64.sys OR *\\\\goad.sys OR *\\\\gpcidrv64.sys OR *\\\\gpu-z.sys OR *\\\\gtckmdfbs.sys OR *\\\\gvcidrv64.sys OR *\\\\hlpdrv.sys OR *\\\\hostnt.sys OR *\\\\hpportiox64.sys OR *\\\\hwdetectng.sys OR *\\\\hwinfo32.sys OR *\\\\hwinfo64i.sys OR *\\\\hwos2ec.sys OR *\\\\hwos2ec10x64.sys OR *\\\\hwos2ec7x64.sys OR *\\\\hwrwdrv.sys OR *\\\\idmtdi.sys OR *\\\\inpout32.sys OR *\\\\inpoutx64.sys OR *\\\\ioaccess.sys OR *\\\\iobitunlocker.sys OR *\\\\iomap.sys OR *\\\\iomap64.sys OR *\\\\iomem.sys OR *\\\\iomem64.sys OR *\\\\iqvw64.sys OR *\\\\iqvw64e.sys OR *\\\\irec.sys OR *\\\\iscflashx64.sys OR *\\\\isodrivep64.sys OR *\\\\jnprva.sys OR *\\\\jokercontroller.sys OR *\\\\k7rkscan.sys OR *\\\\kapchelper_x64.sys OR *\\\\kbdcap64.sys OR *\\\\kdriver.sys OR *\\\\kevp64.sys OR *\\\\kfeco10x64.sys OR *\\\\kfeco11x64.sys OR *\\\\kfecodrv.sys OR *\\\\kprocesshacker.sys OR *\\\\krpocesshacker.sys OR *\\\\ksapi.sys OR *\\\\kt2.sys OR *\\\\ktes.sys OR *\\\\ktgn.sys OR *\\\\lctka.sys OR *\\\\lenovodiagnosticsdriver.sys OR *\\\\lgcoretemp.sys OR *\\\\lgdatacatcher.sys OR *\\\\lgdcatcher.sys OR *\\\\lha.sys OR *\\\\libnicm.sys OR *\\\\lmiinfo.sys OR *\\\\lurker.sys OR *\\\\lv561av.sys OR *\\\\magdrvamd64.sys OR *\\\\malicious.sys OR *\\\\mapmom.sys OR *\\\\mhyprot.sys OR *\\\\mhyprot2.sys OR *\\\\mhyprot3.sys OR *\\\\mhyprotect.sys OR *\\\\mhyprotnap.sys OR *\\\\mhyprotrpg.sys OR *\\\\mimidrv.sys OR *\\\\mjj0ge.sys OR *\\\\monitor.sys OR *\\\\monitor_win10_x64.sys OR *\\\\msio32.sys OR *\\\\msio64.sys OR *\\\\msqpq.sys OR *\\\\msr.sys OR *\\\\msrhook.sys OR *\\\\mtcbsv64.sys OR *\\\\mydrivers.sys OR *\\\\naldrv.sys OR *\\\\nbiolib_x64.sys OR *\\\\nchgbios2x64.sys OR *\\\\ncpl.sys OR *\\\\ndislan.sys OR *\\\\neofltr.sys OR *\\\\netfilter.sys OR *\\\\netfilter2.sys OR *\\\\netfilterdrv.sys OR *\\\\netflt.sys OR *\\\\netproxydriver.sys OR *\\\\ngiodriver.sys OR *\\\\nicm.sys OR *\\\\nodedriver.sys OR *\\\\nqrmq.sys OR *\\\\nscm.sys OR *\\\\nseckrnl.sys OR *\\\\nstr.sys OR *\\\\nstrwsk.sys OR *\\\\nt2.sys OR *\\\\nt3.sys OR *\\\\nt4.sys OR *\\\\nt5.sys OR *\\\\nt6.sys OR *\\\\ntbios.sys OR *\\\\ntbios_2.sys OR *\\\\ntiolib.sys OR *\\\\ntiolib_x64.sys OR *\\\\nvaudio.sys OR *\\\\nvflash.sys OR *\\\\nvflsh32.sys OR *\\\\nvflsh64.sys OR *\\\\nvoclock.sys OR *\\\\openlibsys.sys OR *\\\\otipcibus.sys OR *\\\\otipcibus64.sys OR *\\\\panio.sys OR *\\\\paniox64.sys OR *\\\\panmonflt.sys OR *\\\\panmonfltx64.sys OR *\\\\pchunter.sys OR *\\\\pciecubed.sys OR *\\\\pdfwkrnl.sys OR *\\\\phlashnt.sys OR *\\\\phydmaccx64.sys OR *\\\\phydmaccx86.sys OR *\\\\phymem.sys OR *\\\\phymem_ext64.sys OR *\\\\phymem64.sys OR *\\\\phymemx64.sys OR *\\\\physmem.sys OR *\\\\piddrv.sys OR *\\\\piddrv64.sys OR *\\\\poortry.sys OR *\\\\poortry1.sys OR *\\\\poortry2.sys OR *\\\\probmon.sys OR *\\\\procexp.sys OR *\\\\procexp152.sys OR *\\\\procexp1627.sys OR *\\\\procobsrvesx.sys OR *\\\\prokiller64.sys OR *\\\\protects.sys OR *\\\\proxy32.sys OR *\\\\proxy64.sys OR *\\\\proxydrv.sys OR *\\\\psmounterex.sys OR *\\\\pxitrig64.sys OR *\\\\radhwmgr.sys OR *\\\\rentdrv2.sys OR *\\\\rtcore64.sys OR *\\\\rtcoremini64.sys OR *\\\\rtif.sys OR *\\\\rtkio.sys OR *\\\\rtkio64.sys OR *\\\\rtkiow10x64.sys OR *\\\\rtkiow8x64.sys OR *\\\\rtport.sys OR *\\\\rtsper.sys OR *\\\\rtsuer.sys OR *\\\\rwdrv.sys OR *\\\\rwtkrl.sys OR *\\\\rzpnk.sys OR *\\\\sandra.sys OR *\\\\sbiosio64.sys OR *\\\\se64a.sys OR *\\\\seasunprotect.sys OR *\\\\segwindrvx64.sys OR *\\\\semav6msr.sys OR *\\\\semav6msr64.sys OR *\\\\sense5ext.sys OR *\\\\sepdrv3_1.sys OR *\\\\sfdrvx32.sys OR *\\\\sfdrvx64.sys OR *\\\\skill.sys OR *\\\\smarteio64.sys OR *\\\\smep_capcom.sys OR *\\\\smep_namco.sys OR *\\\\smserl64.sys OR *\\\\speedfan.sys OR *\\\\spf.sys OR *\\\\srvnet2.sys OR *\\\\ssport.sys OR *\\\\stdcdrv64.sys OR *\\\\stdcdrvws64.sys OR *\\\\superbmc.sys OR *\\\\sysconp.sys OR *\\\\sysdrv3s.sys OR *\\\\sysinfo.sys OR *\\\\sysinfodetectorx64.sys OR *\\\\szkg64.sys OR *\\\\tboflhelper.sys OR *\\\\tdeio64.sys OR *\\\\tdklib64.sys OR *\\\\telephonuafy.sys OR *\\\\test2.sys OR *\\\\testbone.sys OR *\\\\tfbfs3ped.sys OR *\\\\tfsysmon.sys OR *\\\\tgsafe.sys OR *\\\\throttlestop.sys OR *\\\\titidrv.sys OR *\\\\tmcomm.sys OR *\\\\tmel.sys OR *\\\\tpwsav.sys OR *\\\\truesight.sys OR *\\\\tsdrvx64.sys OR *\\\\ucorew64.sys OR *\\\\vboxdrv.sys OR *\\\\vboxguest.sys OR *\\\\vboxmousent.sys OR *\\\\vboxtap.sys OR *\\\\vboxusb.sys OR *\\\\vboxusbmon.sys OR *\\\\vdbsv64.sys OR *\\\\viraglt64.sys OR *\\\\viragt.sys OR *\\\\viragt64.sys OR *\\\\viverraudio.sys OR *\\\\vmdrv.sys OR *\\\\vproeventmonitor.sys OR *\\\\vusbbus.sys OR *\\\\wamsdk.sys OR *\\\\wantd.sys OR *\\\\wantd_2.sys OR *\\\\wantd_3.sys OR *\\\\wantd_4.sys OR *\\\\wantd_5.sys OR *\\\\wantd_6.sys OR *\\\\wcpu.sys OR *\\\\wfshbr64.sys OR *\\\\windbg.sys OR *\\\\windivert.sys OR *\\\\windows7-32.sys OR *\\\\windows8-10-32.sys OR *\\\\windows-xp-64.sys OR *\\\\winflash64.sys OR *\\\\winio32.sys OR *\\\\winio32a.sys OR *\\\\winio32b.sys OR *\\\\winio64.sys OR *\\\\winio64a.sys OR *\\\\winio64b.sys OR *\\\\winio64c.sys OR *\\\\winiodrv.sys OR *\\\\winring0.sys OR *\\\\winring0x64.sys OR *\\\\wintapix.sys OR *\\\\wirwadrv.sys OR *\\\\wiseunlo.sys OR *\\\\wnbios.sys OR *\\\\wsdkd.sys OR *\\\\wsftprm.sys OR *\\\\wyproxy32.sys OR *\\\\wyproxy64.sys OR *\\\\xjokercontroller.sys OR *\\\\yyprotect64.sys OR *\\\\zam64.sys OR *\\\\zamguard32.sys OR *\\\\zamguard64.sys)","index":["logs-*","winlogbeat-*","filebeat-*","endgame-*",".siem-signals-*"],"risk_score":73,"severity":"high","tags":["Loaded Potato","BYOVD","LOLDrivers","T1068","T1543.003","attack.privilege-escalation","attack.persistence","Sysmon","Driver"],"author":["Loaded Potato"],"from":"now-24h","interval":"5m","max_signals":100,"version":1}
{"id":"b10ld001-cafe-4200-dead-000000000002","rule_id":"b10ld001-cafe-4200-dead-000000000002","name":"[Loaded Potato] BYOVD - Known Vulnerable Driver Loaded (Elastic Defend)","description":"Detects an Elastic Defend driver-load event for any driver in the LOL Drivers database. Attackers load signed but exploitable kernel drivers (BYOVD  -  Bring Your Own Vulnerable Driver) to disable EDR/AV, escalate to ring-0 privileges, or read/write kernel memory. MITRE ATT\u0026CK: T1068 (Exploitation for Privilege Escalation), T1543.003 (Windows Service). Sources: loldrivers.io API + LOLDrivers Sigma + SigmaHQ. Cache contains 418 drivers as of 2026-03-31. Enable rule and set schedule appropriate to your environment. Regenerate from menu option 10e after updating the LOL Drivers cache.","enabled":false,"type":"query","language":"kuery","query":"event.category: driver AND event.type: load AND driver.path: (*\\\\0x3040_blacklotus_beta_driver.sys OR *\\\\0x3440_blacklotus_v2_driver.sys OR *\\\\8492937_2_driver.sys OR *\\\\accellid.sys OR *\\\\ace-base.sys OR *\\\\acpix86.sys OR *\\\\adrmdrvsys.sys OR *\\\\adv64drv.sys OR *\\\\agent64.sys OR *\\\\air_system10.sys OR *\\\\alsysio.sys OR *\\\\alsysio64.sys OR *\\\\amdpowerprofiler.sys OR *\\\\amdryzenmasterdriver.sys OR *\\\\amifldrv.sys OR *\\\\amifldrv64.sys OR *\\\\amigendrv64.sys OR *\\\\amp.sys OR *\\\\ampa.sys OR *\\\\amsdk.sys OR *\\\\aoddriver.sys OR *\\\\aoddriver2.sys OR *\\\\asas.sys OR *\\\\asio.sys OR *\\\\asio2.sys OR *\\\\asio3.sys OR *\\\\asio3_64.sys OR *\\\\asio32.sys OR *\\\\asio64.sys OR *\\\\asmio.sys OR *\\\\asmio64.sys OR *\\\\asmmap.sys OR *\\\\asmmap64.sys OR *\\\\asrautochkupddrv.sys OR *\\\\asrautochkupddrv_1_0_32.sys OR *\\\\asrdrv.sys OR *\\\\asrdrv10.sys OR *\\\\asrdrv101.sys OR *\\\\asrdrv102.sys OR *\\\\asrdrv103.sys OR *\\\\asrdrv104.sys OR *\\\\asrdrv106.sys OR *\\\\asribdrv.sys OR *\\\\asromgdrv.sys OR *\\\\asrrapidstartdrv.sys OR *\\\\asrsetupdrv103.sys OR *\\\\asrsmartconnectdrv.sys OR *\\\\asupio.sys OR *\\\\asupio64.sys OR *\\\\aswarpot.sys OR *\\\\aswvmm.sys OR *\\\\atillk64.sys OR *\\\\atlaccess.sys OR *\\\\atomicredteamcapcom.sys OR *\\\\atszio.sys OR *\\\\atszio64.sys OR *\\\\avalueio.sys OR *\\\\bandai.sys OR *\\\\bdapiutil.sys OR *\\\\bdapiutil64.sys OR *\\\\bedaisy.sys OR *\\\\biontdrv.sys OR *\\\\black.sys OR *\\\\blackbone.sys OR *\\\\blackbonedrv10.sys OR *\\\\blacklotus_beta_driver.sys OR *\\\\blacklotus_beta_driver_2.sys OR *\\\\blacklotus_beta_driver_3.sys OR *\\\\blacklotus_beta_driver_4.sys OR *\\\\bs_def.sys OR *\\\\bs_def64.sys OR *\\\\bs_flash64.sys OR *\\\\bs_hwmio64.sys OR *\\\\bs_hwmio64_w10.sys OR *\\\\bs_i2c64.sys OR *\\\\bs_i2cio.sys OR *\\\\bs_rcio.sys OR *\\\\bs_rcio64.sys OR *\\\\bs_rciow1064.sys OR *\\\\bsmemx64.sys OR *\\\\bsmi.sys OR *\\\\bsmix64.sys OR *\\\\bsmixp64.sys OR *\\\\burntcigar.sys OR *\\\\bwrs.sys OR *\\\\bwrsh.sys OR *\\\\capcom.sys OR *\\\\capcom2.sys OR *\\\\cg6kwin2k.sys OR *\\\\changsha.sys OR *\\\\chaos-rootkit.sys OR *\\\\citmdrv_amd64.sys OR *\\\\citmdrv_ia64.sys OR *\\\\computerz.sys OR *\\\\corsairllaccess64.sys OR *\\\\cp2x72c.sys OR *\\\\cpupress.sys OR *\\\\cpuz.sys OR *\\\\cpuz_x64.sys OR *\\\\cpuz141.sys OR *\\\\csagent.sys OR *\\\\ctiio64.sys OR *\\\\cupfixerx64.sys OR *\\\\cyvrlpc.sys OR *\\\\daxin_blank.sys OR *\\\\daxin_blank1.sys OR *\\\\daxin_blank2.sys OR *\\\\daxin_blank3.sys OR *\\\\daxin_blank4.sys OR *\\\\daxin_blank5.sys OR *\\\\daxin_blank6.sys OR *\\\\dbk64.sys OR *\\\\dbutil.sys OR *\\\\dbutil_2_3.sys OR *\\\\dbutildrv2.sys OR *\\\\dcprotect.sys OR *\\\\dcr.sys OR *\\\\dellbios.sys OR *\\\\dellinstrumentation.sys OR *\\\\dh_kernel.sys OR *\\\\dh_kernel_10.sys OR *\\\\directio.sys OR *\\\\directio32.sys OR *\\\\directio32_legacy.sys OR *\\\\directio64.sys OR *\\\\dkrtk.sys OR *\\\\driver7.sys OR *\\\\driver7-x64.sys OR *\\\\driver7-x86.sys OR *\\\\driver7-x86-withoutdbg.sys OR *\\\\dwadsafeload.sys OR *\\\\echo.sys OR *\\\\echo_driver.sys OR *\\\\echodriver.sys OR *\\\\ecsiodriver.sys OR *\\\\ecsiodriverx64.sys OR *\\\\eio.sys OR *\\\\elbycdio.sys OR *\\\\elrawdsk.sys OR *\\\\ene.sys OR *\\\\eneio64.sys OR *\\\\enetechio64.sys OR *\\\\etdsupp.sys OR *\\\\fairplaykd.sys OR *\\\\fd3b7234419fafc9bdd533f48896ed73_b816c5cd.sys OR *\\\\fgme.sys OR *\\\\fh-ethercat_dio.sys OR *\\\\fiddrv.sys OR *\\\\fiddrv64.sys OR *\\\\fidpcidrv.sys OR *\\\\fidpcidrv64.sys OR *\\\\fildds.sys OR *\\\\filnk.sys OR *\\\\filwfp.sys OR *\\\\fpcie2com.sys OR *\\\\full.sys OR *\\\\gameink.sys OR *\\\\gametersafe.sys OR *\\\\gdrv.sys OR *\\\\gedevdrv.sys OR *\\\\gftkyj64.sys OR *\\\\glckio2.sys OR *\\\\gmer64.sys OR *\\\\goad.sys OR *\\\\gpcidrv64.sys OR *\\\\gpu-z.sys OR *\\\\gtckmdfbs.sys OR *\\\\gvcidrv64.sys OR *\\\\hlpdrv.sys OR *\\\\hostnt.sys OR *\\\\hpportiox64.sys OR *\\\\hwdetectng.sys OR *\\\\hwinfo32.sys OR *\\\\hwinfo64i.sys OR *\\\\hwos2ec.sys OR *\\\\hwos2ec10x64.sys OR *\\\\hwos2ec7x64.sys OR *\\\\hwrwdrv.sys OR *\\\\idmtdi.sys OR *\\\\inpout32.sys OR *\\\\inpoutx64.sys OR *\\\\ioaccess.sys OR *\\\\iobitunlocker.sys OR *\\\\iomap.sys OR *\\\\iomap64.sys OR *\\\\iomem.sys OR *\\\\iomem64.sys OR *\\\\iqvw64.sys OR *\\\\iqvw64e.sys OR *\\\\irec.sys OR *\\\\iscflashx64.sys OR *\\\\isodrivep64.sys OR *\\\\jnprva.sys OR *\\\\jokercontroller.sys OR *\\\\k7rkscan.sys OR *\\\\kapchelper_x64.sys OR *\\\\kbdcap64.sys OR *\\\\kdriver.sys OR *\\\\kevp64.sys OR *\\\\kfeco10x64.sys OR *\\\\kfeco11x64.sys OR *\\\\kfecodrv.sys OR *\\\\kprocesshacker.sys OR *\\\\krpocesshacker.sys OR *\\\\ksapi.sys OR *\\\\kt2.sys OR *\\\\ktes.sys OR *\\\\ktgn.sys OR *\\\\lctka.sys OR *\\\\lenovodiagnosticsdriver.sys OR *\\\\lgcoretemp.sys OR *\\\\lgdatacatcher.sys OR *\\\\lgdcatcher.sys OR *\\\\lha.sys OR *\\\\libnicm.sys OR *\\\\lmiinfo.sys OR *\\\\lurker.sys OR *\\\\lv561av.sys OR *\\\\magdrvamd64.sys OR *\\\\malicious.sys OR *\\\\mapmom.sys OR *\\\\mhyprot.sys OR *\\\\mhyprot2.sys OR *\\\\mhyprot3.sys OR *\\\\mhyprotect.sys OR *\\\\mhyprotnap.sys OR *\\\\mhyprotrpg.sys OR *\\\\mimidrv.sys OR *\\\\mjj0ge.sys OR *\\\\monitor.sys OR *\\\\monitor_win10_x64.sys OR *\\\\msio32.sys OR *\\\\msio64.sys OR *\\\\msqpq.sys OR *\\\\msr.sys OR *\\\\msrhook.sys OR *\\\\mtcbsv64.sys OR *\\\\mydrivers.sys OR *\\\\naldrv.sys OR *\\\\nbiolib_x64.sys OR *\\\\nchgbios2x64.sys OR *\\\\ncpl.sys OR *\\\\ndislan.sys OR *\\\\neofltr.sys OR *\\\\netfilter.sys OR *\\\\netfilter2.sys OR *\\\\netfilterdrv.sys OR *\\\\netflt.sys OR *\\\\netproxydriver.sys OR *\\\\ngiodriver.sys OR *\\\\nicm.sys OR *\\\\nodedriver.sys OR *\\\\nqrmq.sys OR *\\\\nscm.sys OR *\\\\nseckrnl.sys OR *\\\\nstr.sys OR *\\\\nstrwsk.sys OR *\\\\nt2.sys OR *\\\\nt3.sys OR *\\\\nt4.sys OR *\\\\nt5.sys OR *\\\\nt6.sys OR *\\\\ntbios.sys OR *\\\\ntbios_2.sys OR *\\\\ntiolib.sys OR *\\\\ntiolib_x64.sys OR *\\\\nvaudio.sys OR *\\\\nvflash.sys OR *\\\\nvflsh32.sys OR *\\\\nvflsh64.sys OR *\\\\nvoclock.sys OR *\\\\openlibsys.sys OR *\\\\otipcibus.sys OR *\\\\otipcibus64.sys OR *\\\\panio.sys OR *\\\\paniox64.sys OR *\\\\panmonflt.sys OR *\\\\panmonfltx64.sys OR *\\\\pchunter.sys OR *\\\\pciecubed.sys OR *\\\\pdfwkrnl.sys OR *\\\\phlashnt.sys OR *\\\\phydmaccx64.sys OR *\\\\phydmaccx86.sys OR *\\\\phymem.sys OR *\\\\phymem_ext64.sys OR *\\\\phymem64.sys OR *\\\\phymemx64.sys OR *\\\\physmem.sys OR *\\\\piddrv.sys OR *\\\\piddrv64.sys OR *\\\\poortry.sys OR *\\\\poortry1.sys OR *\\\\poortry2.sys OR *\\\\probmon.sys OR *\\\\procexp.sys OR *\\\\procexp152.sys OR *\\\\procexp1627.sys OR *\\\\procobsrvesx.sys OR *\\\\prokiller64.sys OR *\\\\protects.sys OR *\\\\proxy32.sys OR *\\\\proxy64.sys OR *\\\\proxydrv.sys OR *\\\\psmounterex.sys OR *\\\\pxitrig64.sys OR *\\\\radhwmgr.sys OR *\\\\rentdrv2.sys OR *\\\\rtcore64.sys OR *\\\\rtcoremini64.sys OR *\\\\rtif.sys OR *\\\\rtkio.sys OR *\\\\rtkio64.sys OR *\\\\rtkiow10x64.sys OR *\\\\rtkiow8x64.sys OR *\\\\rtport.sys OR *\\\\rtsper.sys OR *\\\\rtsuer.sys OR *\\\\rwdrv.sys OR *\\\\rwtkrl.sys OR *\\\\rzpnk.sys OR *\\\\sandra.sys OR *\\\\sbiosio64.sys OR *\\\\se64a.sys OR *\\\\seasunprotect.sys OR *\\\\segwindrvx64.sys OR *\\\\semav6msr.sys OR *\\\\semav6msr64.sys OR *\\\\sense5ext.sys OR *\\\\sepdrv3_1.sys OR *\\\\sfdrvx32.sys OR *\\\\sfdrvx64.sys OR *\\\\skill.sys OR *\\\\smarteio64.sys OR *\\\\smep_capcom.sys OR *\\\\smep_namco.sys OR *\\\\smserl64.sys OR *\\\\speedfan.sys OR *\\\\spf.sys OR *\\\\srvnet2.sys OR *\\\\ssport.sys OR *\\\\stdcdrv64.sys OR *\\\\stdcdrvws64.sys OR *\\\\superbmc.sys OR *\\\\sysconp.sys OR *\\\\sysdrv3s.sys OR *\\\\sysinfo.sys OR *\\\\sysinfodetectorx64.sys OR *\\\\szkg64.sys OR *\\\\tboflhelper.sys OR *\\\\tdeio64.sys OR *\\\\tdklib64.sys OR *\\\\telephonuafy.sys OR *\\\\test2.sys OR *\\\\testbone.sys OR *\\\\tfbfs3ped.sys OR *\\\\tfsysmon.sys OR *\\\\tgsafe.sys OR *\\\\throttlestop.sys OR *\\\\titidrv.sys OR *\\\\tmcomm.sys OR *\\\\tmel.sys OR *\\\\tpwsav.sys OR *\\\\truesight.sys OR *\\\\tsdrvx64.sys OR *\\\\ucorew64.sys OR *\\\\vboxdrv.sys OR *\\\\vboxguest.sys OR *\\\\vboxmousent.sys OR *\\\\vboxtap.sys OR *\\\\vboxusb.sys OR *\\\\vboxusbmon.sys OR *\\\\vdbsv64.sys OR *\\\\viraglt64.sys OR *\\\\viragt.sys OR *\\\\viragt64.sys OR *\\\\viverraudio.sys OR *\\\\vmdrv.sys OR *\\\\vproeventmonitor.sys OR *\\\\vusbbus.sys OR *\\\\wamsdk.sys OR *\\\\wantd.sys OR *\\\\wantd_2.sys OR *\\\\wantd_3.sys OR *\\\\wantd_4.sys OR *\\\\wantd_5.sys OR *\\\\wantd_6.sys OR *\\\\wcpu.sys OR *\\\\wfshbr64.sys OR *\\\\windbg.sys OR *\\\\windivert.sys OR *\\\\windows7-32.sys OR *\\\\windows8-10-32.sys OR *\\\\windows-xp-64.sys OR *\\\\winflash64.sys OR *\\\\winio32.sys OR *\\\\winio32a.sys OR *\\\\winio32b.sys OR *\\\\winio64.sys OR *\\\\winio64a.sys OR *\\\\winio64b.sys OR *\\\\winio64c.sys OR *\\\\winiodrv.sys OR *\\\\winring0.sys OR *\\\\winring0x64.sys OR *\\\\wintapix.sys OR *\\\\wirwadrv.sys OR *\\\\wiseunlo.sys OR *\\\\wnbios.sys OR *\\\\wsdkd.sys OR *\\\\wsftprm.sys OR *\\\\wyproxy32.sys OR *\\\\wyproxy64.sys OR *\\\\xjokercontroller.sys OR *\\\\yyprotect64.sys OR *\\\\zam64.sys OR *\\\\zamguard32.sys OR *\\\\zamguard64.sys)","index":["logs-*","endgame-*",".siem-signals-*"],"risk_score":73,"severity":"high","tags":["Loaded Potato","BYOVD","LOLDrivers","T1068","T1543.003","attack.privilege-escalation","attack.persistence","Elastic Defend","Driver"],"author":["Loaded Potato"],"from":"now-24h","interval":"5m","max_signals":100,"version":1}
{"id":"b10ld001-cafe-4200-dead-000000000003","rule_id":"b10ld001-cafe-4200-dead-000000000003","name":"[Loaded Potato] BYOVD - Critical EDR Killer Driver Loaded","description":"Detects the highest-risk BYOVD kernel drivers individually confirmed in active ransomware and nation-state APT campaigns specifically to kill EDR/AV and escalate kernel privileges. Any match is high-confidence malicious with no expected legitimate use in a production environment. Covered drivers: aswarpot.sys, aswvmm.sys, bedaisy.sys, blackbone.sys, blackbonedrv10.sys, capcom.sys, dbutil.sys, dbutil_2_3.sys, dbutildrv2.sys, gdrv.sys, iqvw64.sys, iqvw64e.sys, kprocesshacker.sys, mhyprot.sys, mhyprot2.sys, mhyprot3.sys, mhyprotect.sys, mhyprotnap.sys, procexp.sys, procexp152.sys, rtcore64.sys, truesight.sys, zam64.sys, zamguard64.sys. Campaigns: BlackByte (RTCore64), SCATTERED SPIDER (RTCore64), Genshin ransomware (mhyprot variants), Terminator/BURNTCIGAR (zamguard64/zam64), RobbinHood (gdrv), AvosLocker/POORTRY (aswArPot), Lazarus Group (bedaisy, kprocesshacker). MITRE ATT\u0026CK: T1068, T1543.003, T1562.001.","enabled":false,"type":"query","language":"kuery","query":"(winlog.event_id: 6 AND winlog.event_data.ImageLoaded: (*\\\\aswarpot.sys OR *\\\\aswvmm.sys OR *\\\\bedaisy.sys OR *\\\\blackbone.sys OR *\\\\blackbonedrv10.sys OR *\\\\capcom.sys OR *\\\\dbutil.sys OR *\\\\dbutil_2_3.sys OR *\\\\dbutildrv2.sys OR *\\\\gdrv.sys OR *\\\\iqvw64.sys OR *\\\\iqvw64e.sys OR *\\\\kprocesshacker.sys OR *\\\\mhyprot.sys OR *\\\\mhyprot2.sys OR *\\\\mhyprot3.sys OR *\\\\mhyprotect.sys OR *\\\\mhyprotnap.sys OR *\\\\procexp.sys OR *\\\\procexp152.sys OR *\\\\rtcore64.sys OR *\\\\truesight.sys OR *\\\\zam64.sys OR *\\\\zamguard64.sys)) OR (event.category: driver AND event.type: load AND driver.path: (*\\\\aswarpot.sys OR *\\\\aswvmm.sys OR *\\\\bedaisy.sys OR *\\\\blackbone.sys OR *\\\\blackbonedrv10.sys OR *\\\\capcom.sys OR *\\\\dbutil.sys OR *\\\\dbutil_2_3.sys OR *\\\\dbutildrv2.sys OR *\\\\gdrv.sys OR *\\\\iqvw64.sys OR *\\\\iqvw64e.sys OR *\\\\kprocesshacker.sys OR *\\\\mhyprot.sys OR *\\\\mhyprot2.sys OR *\\\\mhyprot3.sys OR *\\\\mhyprotect.sys OR *\\\\mhyprotnap.sys OR *\\\\procexp.sys OR *\\\\procexp152.sys OR *\\\\rtcore64.sys OR *\\\\truesight.sys OR *\\\\zam64.sys OR *\\\\zamguard64.sys))","index":["logs-*","winlogbeat-*","filebeat-*","endgame-*",".siem-signals-*"],"risk_score":99,"severity":"critical","tags":["Loaded Potato","BYOVD","LOLDrivers","EDR Killer","T1068","T1543.003","T1562.001","attack.privilege-escalation","attack.defense-evasion","attack.persistence","Critical","Driver"],"author":["Loaded Potato"],"from":"now-24h","interval":"5m","max_signals":100,"version":1}
